## Deliverables:

- Submit two files that have the name: <font color = 'red'>YourLastName_Exercise_2</font> that include the following files:

 1. An **HTML file** that has your Source code and output
 2. Your **ipynb script** that has your Source code and output


# Objectives:

In this exercise, you will:

 - Perform data analysis tasks on data read from a CSV file and loaded into a DataFrame object
 - Use sqlalchemy to load data stored in a DatFrame object into sqlite database engine
 - Use sqlalchemy to connect to sqlite database engine to execute  SQL  queries


Formatting Python Code
When programming in Python, refer to Kenneth Reitz’ PEP 8: The Style Guide for Python Code:
http://pep8.org/ (Links to an external site.)Links to an external site.
There is the Google style guide for Python at
https://google.github.io/styleguide/pyguide.html (Links to an external site.)Links to an external site.
Comment often and in detail.

In [104]:
# import libraries
import os
import pandas as pd 
import numpy as np

In [105]:
# allow muliple output in one cell window
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [106]:
# read in the file
xyzcust10 = pd.read_csv('xyzcust10.csv')

# what are the data types
(xyzcust10).dtypes

ACCTNO                    object
ZIP                        int64
ZIP4                       int64
LTD_SALES                float64
LTD_TRANSACTIONS           int64
YTD_SALES_2009           float64
YTD_TRANSACTIONS_2009      int64
CHANNEL_ACQUISITION       object
BUYER_STATUS              object
ZIP9_Supercode             int64
ZIP9_SUPERCODE             int64
dtype: object

In [107]:
# info compared to dtypes
xyzcust10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30471 entries, 0 to 30470
Data columns (total 11 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ACCTNO                 30471 non-null  object
 1   ZIP                    30471 non-null  int64
 2   ZIP4                   30471 non-null  int64
 3   LTD_SALES              30471 non-null  float64
 4   LTD_TRANSACTIONS       30471 non-null  int64
 5   YTD_SALES_2009         30471 non-null  float64
 6   YTD_TRANSACTIONS_2009  30471 non-null  int64
 7   CHANNEL_ACQUISITION    30471 non-null  object
 8   BUYER_STATUS           30471 non-null  object
 9   ZIP9_Supercode         30471 non-null  int64
 10  ZIP9_SUPERCODE         30471 non-null  int64
dtypes: float64(2), int64(6), object(3)
memory usage: 2.6+ MB

In [108]:
# all objects in python are given a unique id
id(xyzcust10)

# in this case the object 'test' is the same as object 'xyzcust10'
# a change to either one changes both
test = xyzcust10
id(test)

140188723872336

140188723872336

In [109]:
# want to see if these two objects are the same?
# we added a column to test dataframe and it also added to xyzcust10!!!!
# that is becuase they are the same object
test['test'] = test['LTD_SALES']/test['LTD_TRANSACTIONS']
test.info()
xyzcust10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30471 entries, 0 to 30470
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ACCTNO                 30471 non-null  object
 1   ZIP                    30471 non-null  int64
 2   ZIP4                   30471 non-null  int64
 3   LTD_SALES              30471 non-null  float64
 4   LTD_TRANSACTIONS       30471 non-null  int64
 5   YTD_SALES_2009         30471 non-null  float64
 6   YTD_TRANSACTIONS_2009  30471 non-null  int64
 7   CHANNEL_ACQUISITION    30471 non-null  object
 8   BUYER_STATUS           30471 non-null  object
 9   ZIP9_Supercode         30471 non-null  int64
 10  ZIP9_SUPERCODE         30471 non-null  int64
 11  test                   30471 non-null  float64
dtypes: float64(3), int64(6), object(3)
memory usage: 2.8+ MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30471 entries, 0 to 30470
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ACCTNO                 30471 non-null  object
 1   ZIP                    30471 non-null  int64
 2   ZIP4                   30471 non-null  int64
 3   LTD_SALES              30471 non-null  float64
 4   LTD_TRANSACTIONS       30471 non-null  int64
 5   YTD_SALES_2009         30471 non-null  float64
 6   YTD_TRANSACTIONS_2009  30471 non-null  int64
 7   CHANNEL_ACQUISITION    30471 non-null  object
 8   BUYER_STATUS           30471 non-null  object
 9   ZIP9_Supercode         30471 non-null  int64
 10  ZIP9_SUPERCODE         30471 non-null  int64
 11  test                   30471 non-null  float64
dtypes: float64(3), int64(6), object(3)
memory usage: 2.8+ MB

In [110]:
# make a copy and get differnt object ids
# now you can independently manipulate each copy and leave the original intact
xyzcust10red = xyzcust10.copy() 

xyzcust10rev1 = xyzcust10.copy() 

id(xyzcust10)
id(xyzcust10red)
id(xyzcust10rev1)

140188723872336

140187339924048

140188705969872

In [111]:
# working with a Pandas DataFrame
type(xyzcust10)

pandas.core.frame.DataFrame

In [112]:
# check out the first five records
xyzcust10.head()

# check out the last five records
xyzcust10.tail()

,ACCTNO,ZIP,ZIP4,LTD_SALES,LTD_TRANSACTIONS,YTD_SALES_2009,YTD_TRANSACTIONS_2009,CHANNEL_ACQUISITION,BUYER_STATUS,ZIP9_Supercode,ZIP9_SUPERCODE,test
0,WDQQLLDQL,60084,5016,90.0,1,0.0,0,IB,INACTIVE,600845016,600845016,90.000000
1,WQWAYHYLA,60091,1750,4227.0,9,1263.0,3,RT,ACTIVE,600911750,600911750,469.666667
2,GSHAPLHAW,60067,900,420.0,3,129.0,1,RT,ACTIVE,600670900,600670900,140.000000
3,PGGYDYWAD,60068,3838,6552.0,6,0.0,0,RT,INACTIVE,600683838,600683838,1092.000000
4,LWPSGPLLS,60090,3932,189.0,3,72.0,1,RT,ACTIVE,600903932,600903932,63.000000

,ACCTNO,ZIP,ZIP4,LTD_SALES,LTD_TRANSACTIONS,YTD_SALES_2009,YTD_TRANSACTIONS_2009,CHANNEL_ACQUISITION,BUYER_STATUS,ZIP9_Supercode,ZIP9_SUPERCODE,test
30466,SYDQYLSWH,60098,3951,2736.0,9,96.0,1,RT,ACTIVE,600983951,600983951,304.0000
30467,SAPDQHQLP,60098,9681,2412.0,8,108.0,1,RT,ACTIVE,600989681,600989681,301.5000
30468,SASYAPDSY,60098,0,429.0,1,0.0,0,RT,INACTIVE,600983858,600983858,429.0000
30469,PWQPDWHA,60098,7927,651.0,1,0.0,0,RT,INACTIVE,600987927,600987927,651.0000
30470,SQQHDYHWH,60098,4160,4527.0,16,672.0,2,RT,ACTIVE,600984160,600984160,282.9375

xyzcust10 appears to have two nine-digit ZIP “supercode” columns with slightly different column labels or names.  To see them, try entering xyzcust10.columns or xyzcust10.dtypes at the command prompt.  Are the values in these two columns the same?  If so, we can get rid of one of them.  There are different ways we can figure out whether they are the same, but a simple way is to test each pair of values to see if they are equal or not.

In [113]:
# check out the columns
xyzcust10.columns

# can put columns in a list - may come in handy sometime
col_list = list(xyzcust10.columns)
type(col_list)
col_list

Index(['ACCTNO', 'ZIP', 'ZIP4', 'LTD_SALES', 'LTD_TRANSACTIONS',
       'YTD_SALES_2009', 'YTD_TRANSACTIONS_2009', 'CHANNEL_ACQUISITION',
       'BUYER_STATUS', 'ZIP9_Supercode', 'ZIP9_SUPERCODE', 'test'],
      dtype='object')

list

['ACCTNO',
 'ZIP',
 'ZIP4',
 'LTD_SALES',
 'LTD_TRANSACTIONS',
 'YTD_SALES_2009',
 'YTD_TRANSACTIONS_2009',
 'CHANNEL_ACQUISITION',
 'BUYER_STATUS',
 'ZIP9_Supercode',
 'ZIP9_SUPERCODE',
 'test']

In [114]:
# are the two zip code columns exactly the same
# logical comparison
(xyzcust10.ZIP9_Supercode != xyzcust10.ZIP9_SUPERCODE).sum()

0

So, Oops!  Someone included the same column in the data twice, but with slightly different names. Why waste the space?  Why risk confusion?  Let's get rid of one of them:

We could do:

In [115]:
# deletes the series in-place. Can only operate on one item at a time
del xyzcust10['ZIP9_Supercode']
del xyzcust10['test']

del xyzcust10rev1['ZIP9_Supercode']
del xyzcust10rev1['test']

or

In [116]:
# Pandas drop command
xyzcust10red.drop(['ZIP9_Supercode','test'], axis=1, inplace=True)
xyzcust10red.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30471 entries, 0 to 30470
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ACCTNO                 30471 non-null  object
 1   ZIP                    30471 non-null  int64
 2   ZIP4                   30471 non-null  int64
 3   LTD_SALES              30471 non-null  float64
 4   LTD_TRANSACTIONS       30471 non-null  int64
 5   YTD_SALES_2009         30471 non-null  float64
 6   YTD_TRANSACTIONS_2009  30471 non-null  int64
 7   CHANNEL_ACQUISITION    30471 non-null  object
 8   BUYER_STATUS           30471 non-null  object
 9   ZIP9_SUPERCODE         30471 non-null  int64
dtypes: float64(2), int64(5), object(3)
memory usage: 2.3+ MB

Let's next look at xyz transactional data that is in a table in a SQLite3 relational database (“RDB”) file that's called xyz.db.  You should have put the xyz.db file you downloaded from Canvas in the same directory as your python code.

You can use os.getcwd() to see your current directory.

In [117]:
os.getcwd()

'/Users/annalawrence/Desktop/MSDS 420/Week 4/Exercise 2'

If you installed the sqlite3 client, you can take a look at this database (“DB”) without using Python. sqlSQLite3 is a very simple and easy to use RDB, and it doesn't require a server.  Assuming that you've installed it and that you're in the directory where you put xyz.db, using the command from your OS command prompt:

c:\Users\Sharon\Desktop\MSDS 420\Mod 5 Exercise 3>sqlite3 xyz.db
SQLite version 3.21.0 2017-10-24 18:55:49
Enter ".help" for usage hints.
sqlite>

will start sqlite3 and open the db file.  You can see the tables in this db with the sqlite3 command .tables .  (That's a period, “.” before tables. “Help” in sqlSQLite3 is .help  .)

sqlite> .tables
xyztrans
sqlite>

There are a couple of different ways to read and write data to RDBs using Python, but the most flexible and easiest may be by using what's in pandas.  Pandas will make use of the SQLAlchemy package. SQLAlchemy provides a consistent interface with different RDBs, SQLite being one of them.

Let's get SQLAlchemy into our IPython session:

In [118]:
import sqlalchemy
from sqlalchemy import create_engine

Now let's specify the xyz db as the SQLite3 RDB we want to work with:

In [119]:
engine = create_engine('sqlite:///xyz.db')

This assumes that you have xyz.db in your current working directory.  There are different valid syntaxes, e.g.

sqlite:///:memory: (or, sqlite://) 
sqlite:///relative/path/to/file.db 
sqlite:////absolute/path/to/file.db 

We used the second syntax, above.  Be sure to use the correct number of slashes for the version you want to use.  You need the enclosing single quotes, too.

There's only one table in this RDB.  It's called “xyztrans.” Let's read it into a DataFrame:

In [120]:
# read in one table
xyztrans = pd.read_sql('xyztrans', engine)
xyztrans.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62395 entries, 0 to 62394
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   index         62395 non-null  int64
 1   ACCTNO        62395 non-null  object
 2   QTY           62395 non-null  int64
 3   TRANDATE      62395 non-null  object
 4   TRAN_CHANNEL  62395 non-null  object
 5   PRICE         62395 non-null  float64
 6   TOTAMT        62395 non-null  float64
 7   ORDERNO       62395 non-null  object
 8   DEPTDESCR     62395 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 4.3+ MB

This db has only one table in it.  What if it had more than one, and you didn't know their names?  How would you know? Well, one way is to read some “metadata” from it:

In [121]:
from sqlalchemy import schema

In [122]:
xyzMetaData=schema.MetaData(bind=engine)
xyzMetaData.reflect()

In [123]:
xyzMetaData.tables

FacadeDict({'xyzcust': Table('xyzcust', MetaData(bind=Engine(sqlite:///xyz.db)), Column('index', BIGINT(), table=<xyzcust>), Column('ACCTNO', TEXT(), table=<xyzcust>), Column('ZIP', BIGINT(), table=<xyzcust>), Column('ZIP4', BIGINT(), table=<xyzcust>), Column('LTD_SALES', FLOAT(), table=<xyzcust>), Column('LTD_TRANSACTIONS', BIGINT(), table=<xyzcust>), Column('YTD_SALES_2009', FLOAT(), table=<xyzcust>), Column('YTD_TRANSACTIONS_2009', BIGINT(), table=<xyzcust>), Column('CHANNEL_ACQUISITION', TEXT(), table=<xyzcust>), Column('BUYER_STATUS', TEXT(), table=<xyzcust>), Column('ZIP9_SUPERCODE', BIGINT(), table=<xyzcust>), schema=None), 'xyztrans': Table('xyztrans', MetaData(bind=Engine(sqlite:///xyz.db)), Column('index', BIGINT(), table=<xyztrans>), Column('ACCTNO', TEXT(), table=<xyztrans>), Column('QTY', BIGINT(), table=<xyztrans>), Column('TRANDATE', TEXT(), table=<xyztrans>), Column('TRAN_CHANNEL', TEXT(), table=<xyztrans>), Column('PRICE', FLOAT(), table=<xyztrans>), Column('TOTAMT', FLOAT(), table=<xyztrans>), Column('ORDERNO', TEXT(), table=<xyztrans>), Column('DEPTDESCR', TEXT(), table=<xyztrans>), schema=None)})


xyzMetaData.tables will be a dict that contains information about the db.  Tables will be keys in this dict:

In [124]:
# ----------------------------------------------------------------------------------
# if you have run this code before, you will have xyzcust table in your database
# to remove the table, you can run the code below
# ----------------------------------------------------------------------------------
sql = ('DROP TABLE IF EXISTS xyzcust;')
result = engine.execute(sql)

# you should only be able to see the yxztrans table
xyzMetaData=schema.MetaData(bind=engine)
xyzMetaData.reflect()
xyzMetaData.tables

FacadeDict({'xyztrans': Table('xyztrans', MetaData(bind=Engine(sqlite:///xyz.db)), Column('index', BIGINT(), table=<xyztrans>), Column('ACCTNO', TEXT(), table=<xyztrans>), Column('QTY', BIGINT(), table=<xyztrans>), Column('TRANDATE', TEXT(), table=<xyztrans>), Column('TRAN_CHANNEL', TEXT(), table=<xyztrans>), Column('PRICE', FLOAT(), table=<xyztrans>), Column('TOTAMT', FLOAT(), table=<xyztrans>), Column('ORDERNO', TEXT(), table=<xyztrans>), Column('DEPTDESCR', TEXT(), table=<xyztrans>), schema=None)})

In [125]:
xyzMetaData.tables.keys()

dict_keys(['xyztrans'])


At this point there's only one table name, 'xyztrans,” in xyz.db.  You'll see another method for inspecting DB's below.

We're going to write the xyz customer records into a new table in the sqlite3 RDB, but before we do that let's make sure that the records are unique, that is, that no customer has more than one record.   We can do this with some pandas DataFrame methods.  Using the customer DataFrame xyzcust10rev1

In [126]:
# lets check for row duplicates
xyzcust10rev1.duplicated().sum()

292

will return a zero if all records are unique, or the number of rows in xyzcust10rev1 that are duplicates.  The reason is that the duplicated() method for the DataFrame returns a Series of Trues and Falses, a Boolean Series.  Summing over the Series forces the values to be cast as numeric.

Oops.  There are some duplicates.  How many duplicates do you find in xyzcust10rev1?

To rid a DataFrame of unduplicated rows,

In [127]:
# drop duplicates and then make sure they are gone
xyzcustUnDup = xyzcust10rev1.drop_duplicates()

xyzcustUnDup.duplicated().sum()

id(xyzcust10rev1)
# a drop_duplicates creates a new object
id(xyzcustUnDup)

0

140188705969872

140188738608720


How many unique customer records do you now have?  By the way, note that you could have limited your examination to just one or more columns, for example just ACCTNO, customer account number, by providing ACCTNO as an argument or by using it to define a Series:

In [128]:
xyzcust10rev1.duplicated('ACCTNO').sum()

292

In [129]:
xyzcust10rev1.ACCTNO.duplicated().sum()

292


When there are duplicates of a record, which of them do you think .drop_duplicates() retains?

Now that we've checked for, and have removed, duplicate customer records, from the customer records, let's write them into a new table in xyztrans.db.

In [130]:
# add the data from the csv file into a new table in xyz database
xyzcustUnDup.to_sql('xyzcust', engine)

Did it create the table in xyz.db?  Check:

In [131]:
pd.read_sql_table('xyzcust', engine).columns

Index(['index', 'ACCTNO', 'ZIP', 'ZIP4', 'LTD_SALES', 'LTD_TRANSACTIONS',
       'YTD_SALES_2009', 'YTD_TRANSACTIONS_2009', 'CHANNEL_ACQUISITION',
       'BUYER_STATUS', 'ZIP9_SUPERCODE'],
      dtype='object')

should produce the columns of the DataFrame you wrote to the db.  Remember that “engine” refers to the SQLite3 DB by way of defining the connection using SQLAlchemy's create_engine method.

How many tables are there now in xyz.db?  And, what are their names?

In [132]:
xyzMetaData=schema.MetaData(bind=engine)
xyzMetaData.reflect()
xyzMetaData.tables

FacadeDict({'xyzcust': Table('xyzcust', MetaData(bind=Engine(sqlite:///xyz.db)), Column('index', BIGINT(), table=<xyzcust>), Column('ACCTNO', TEXT(), table=<xyzcust>), Column('ZIP', BIGINT(), table=<xyzcust>), Column('ZIP4', BIGINT(), table=<xyzcust>), Column('LTD_SALES', FLOAT(), table=<xyzcust>), Column('LTD_TRANSACTIONS', BIGINT(), table=<xyzcust>), Column('YTD_SALES_2009', FLOAT(), table=<xyzcust>), Column('YTD_TRANSACTIONS_2009', BIGINT(), table=<xyzcust>), Column('CHANNEL_ACQUISITION', TEXT(), table=<xyzcust>), Column('BUYER_STATUS', TEXT(), table=<xyzcust>), Column('ZIP9_SUPERCODE', BIGINT(), table=<xyzcust>), schema=None), 'xyztrans': Table('xyztrans', MetaData(bind=Engine(sqlite:///xyz.db)), Column('index', BIGINT(), table=<xyztrans>), Column('ACCTNO', TEXT(), table=<xyztrans>), Column('QTY', BIGINT(), table=<xyztrans>), Column('TRANDATE', TEXT(), table=<xyztrans>), Column('TRAN_CHANNEL', TEXT(), table=<xyztrans>), Column('PRICE', FLOAT(), table=<xyztrans>), Column('TOTAMT', FLOAT(), table=<xyztrans>), Column('ORDERNO', TEXT(), table=<xyztrans>), Column('DEPTDESCR', TEXT(), table=<xyztrans>), schema=None)})

In [133]:
xyzMetaData.tables.keys()

dict_keys(['xyzcust', 'xyztrans'])

Another way to look at the metadata of an RDB using SQLAlchemy is by using the “inspect” method:

In [134]:
xyzMetaData

MetaData(bind=Engine(sqlite:///xyz.db))

In [135]:
from sqlalchemy import inspect
insp = inspect(engine)
insp.get_table_names()

['xyzcust', 'xyztrans']

You can use SQLAlchemy to query a DB so as to import selected records from an RDB.  You can also append records to existing tables in an RDB, create various kinds of DB indexes, and pretty much do everything you would do using standard SQL while interacting with an RDB using a client for it.   As a query example, suppose we wanted to select from the xyz tranaction data in the xyztrans.db all transactions made in XYZ's retail stores.  These are coded as RT in the table's TRAN_CHANNEL.  We could do:

In [136]:
# create an easy to read SQL statement
rttrans = pd.read_sql_query("SELECT * \
                             FROM xyztrans \
                             WHERE TRAN_CHANNEL='RT'", engine)
rttrans.head()

,index,ACCTNO,QTY,TRANDATE,TRAN_CHANNEL,PRICE,TOTAMT,ORDERNO,DEPTDESCR
0,0,WGDQLA,1,09JUN2009,RT,599.85,599.85,CCXXNNXXXXUX,Home Audio
1,1,WGDQLA,1,09JUN2009,RT,39.00,39.00,CCXXNNXXXXUX,Small Appliances
2,2,WGDQLA,1,28NOV2009,RT,15.00,15.00,CCXNXXKXXXRI,Small Appliances
3,3,WGDQLA,1,28NOV2009,RT,69.00,69.00,CCXNXXKXXXRI,Small Appliances
4,4,WGDQLA,1,28NOV2009,RT,84.00,84.00,CCXNXXKXXXRI,Small Appliances

In [137]:
# don't like using the \ as shown above, then can use the triple single quotes
rttrans1 = pd.read_sql_query('''SELECT * 
                             FROM xyztrans 
                             WHERE TRAN_CHANNEL="RT"''', engine)
rttrans1.head()

,index,ACCTNO,QTY,TRANDATE,TRAN_CHANNEL,PRICE,TOTAMT,ORDERNO,DEPTDESCR
0,0,WGDQLA,1,09JUN2009,RT,599.85,599.85,CCXXNNXXXXUX,Home Audio
1,1,WGDQLA,1,09JUN2009,RT,39.00,39.00,CCXXNNXXXXUX,Small Appliances
2,2,WGDQLA,1,28NOV2009,RT,15.00,15.00,CCXNXXKXXXRI,Small Appliances
3,3,WGDQLA,1,28NOV2009,RT,69.00,69.00,CCXNXXKXXXRI,Small Appliances
4,4,WGDQLA,1,28NOV2009,RT,84.00,84.00,CCXNXXKXXXRI,Small Appliances

In [138]:
# and another option
qstring = '''SELECT * 
             FROM xyztrans 
             WHERE TRAN_CHANNEL="RT"'''
rttrans2 = pd.read_sql_query(qstring, engine)
rttrans2.head()

,index,ACCTNO,QTY,TRANDATE,TRAN_CHANNEL,PRICE,TOTAMT,ORDERNO,DEPTDESCR
0,0,WGDQLA,1,09JUN2009,RT,599.85,599.85,CCXXNNXXXXUX,Home Audio
1,1,WGDQLA,1,09JUN2009,RT,39.00,39.00,CCXXNNXXXXUX,Small Appliances
2,2,WGDQLA,1,28NOV2009,RT,15.00,15.00,CCXNXXKXXXRI,Small Appliances
3,3,WGDQLA,1,28NOV2009,RT,69.00,69.00,CCXNXXKXXXRI,Small Appliances
4,4,WGDQLA,1,28NOV2009,RT,84.00,84.00,CCXNXXKXXXRI,Small Appliances


A last point about SQLAlchemy:  it has its own declarative language that provides means of interacting with DB's that is more “object oriented” than traditional SQL is.  You can find lots of documentation about SQLAlchemy at http://www.sqlalchemy.org.

In [139]:
# read in all customer data
customers = pd.read_sql_query("SELECT * \
                                FROM xyzcust", engine)
# look at first 5 rows
customers.head()

,index,ACCTNO,ZIP,ZIP4,LTD_SALES,LTD_TRANSACTIONS,YTD_SALES_2009,YTD_TRANSACTIONS_2009,CHANNEL_ACQUISITION,BUYER_STATUS,ZIP9_SUPERCODE
0,0,WDQQLLDQL,60084,5016,90.0,1,0.0,0,IB,INACTIVE,600845016
1,1,WQWAYHYLA,60091,1750,4227.0,9,1263.0,3,RT,ACTIVE,600911750
2,2,GSHAPLHAW,60067,900,420.0,3,129.0,1,RT,ACTIVE,600670900
3,3,PGGYDYWAD,60068,3838,6552.0,6,0.0,0,RT,INACTIVE,600683838
4,4,LWPSGPLLS,60090,3932,189.0,3,72.0,1,RT,ACTIVE,600903932

In [140]:
# read in all transactional data
transactions = pd.read_sql_query("SELECT * \
                                    FROM xyztrans", engine)
# look at first five rows
transactions.head()

,index,ACCTNO,QTY,TRANDATE,TRAN_CHANNEL,PRICE,TOTAMT,ORDERNO,DEPTDESCR
0,0,WGDQLA,1,09JUN2009,RT,599.85,599.85,CCXXNNXXXXUX,Home Audio
1,1,WGDQLA,1,09JUN2009,RT,39.00,39.00,CCXXNNXXXXUX,Small Appliances
2,2,WGDQLA,1,28NOV2009,RT,15.00,15.00,CCXNXXKXXXRI,Small Appliances
3,3,WGDQLA,1,28NOV2009,RT,69.00,69.00,CCXNXXKXXXRI,Small Appliances
4,4,WGDQLA,1,28NOV2009,RT,84.00,84.00,CCXNXXKXXXRI,Small Appliances

In [141]:
# now that you have read in your database into dataframes, you can use 
# the dataframes to analyze your data.

# BUT FOR YOUR HOMEWORK, YOU ARE TO USE SQL 

transactions['TRAN_CHANNEL'].value_counts()

transactions['DEPTDESCR'].value_counts()

customers['ZIP'].value_counts()

RT    53811
IB     6373
CB     2211
Name: TRAN_CHANNEL, dtype: int64

Mobile Electronic Accessories    18007
Small Appliances                 15641
Mobile Electronics               13063
Home Audio                        7257
Portable Electronics              5691
Cameras & Camcorder Accessori     2732
Appliances                           4
Name: DEPTDESCR, dtype: int64

60091    3422
60093    3152
60062    3059
60067    3022
60068    2754
60089    1990
60056    1515
60074    1297
60060    1283
60061    1197
60076    1081
60069     776
60077     735
60084     717
60073     678
60090     644
60098     562
60070     458
60085     377
60083     342
60081     318
60087     264
60097     150
60096     122
60071      97
60064      41
60072      34
60088      28
60078      25
60065      21
60075       5
60094       4
60082       3
60192       2
60079       2
60095       1
0           1
Name: ZIP, dtype: int64

In [142]:
# SQL groupby lets you summarize 
# https://www.sqlitetutorial.net/sqlite-group-by/

channel = pd.read_sql_query("SELECT TRAN_CHANNEL, count(ACCTNO) as Customers  \
                             FROM xyztrans \
                             GROUP BY TRAN_CHANNEL", engine)
channel

  TRAN_CHANNEL  Customers
0           CB       2211
1           IB       6373
2           RT      53811

<div class="alert alert-block alert-warning">

# Requirements :

### Note that all of your answers should use SQL and SQLAlchemy to answer the homework requirements.

</div>

### Requirement 1 (8 points)

Show all customers (ACCTNO) that have over 10,000 dollar sales in 2009 and over 25,000 dollar sales in LTD_Sales. Display **ACCTNO, LTD_SALES** and **YTD_SALES_2009** columns.

In [143]:
cust1 = pd.read_sql_query("SELECT ACCTNO, LTD_SALES, YTD_SALES_2009  \
                             FROM xyzcust \
                             WHERE LTD_SALES > 25000 and YTD_SALES_2009 >10000", engine)
cust1

      ACCTNO  LTD_SALES  YTD_SALES_2009
0  LGYYAGQQA    47307.0         12684.0
1  LLSYGYDAY  2247750.0        351000.0
2    SAPYPAP   122352.0         28002.0
3  SDAPWQHLD    40329.0         11616.0

### Requirement 2 (8 points)

Show a list of customers that live in zip 60076 and have over 30 LTD Transactions. Display **ACCTNO, LTD_TRANSACTIONS,** and **ZIP** columns.

In [144]:
cust2 = pd.read_sql_query("SELECT ACCTNO, LTD_TRANSACTIONS, ZIP  \
                             FROM xyzcust \
                             WHERE ZIP = 60076 and LTD_TRANSACTIONS > 30", engine)
cust2

      ACCTNO  LTD_TRANSACTIONS    ZIP
0  PHQQYAYQW                31  60076
1  GGGSDSLQD                32  60076
2  SPSAQHAGA                35  60076
3  WWPYQDQDY                33  60076

### Requirement 3 (8 points)

List the inactive customers that had over 5,000 dollar LTD sales. Sort by LTD Sales with highest amount on top. Display the account number **(ACCTNO)** and the **LTD_SALES**.

In [145]:
cust3 = pd.read_sql_query("SELECT ACCTNO, LTD_SALES \
                             FROM xyzcust \
                             WHERE BUYER_STATUS = 'INACTIVE' and LTD_SALES > 5000", engine)
cust3

       ACCTNO  LTD_SALES
0   PGGYDYWAD     6552.0
1    SPDADPWP     5697.0
2   LGWQSDHPP     6231.0
3   LQDSGYWAA     7263.0
4   AALHDLWAD     6516.0
5   AGDDPGHWW     6042.0
6   SLLWSYPAW     6882.0
7   WDGYGLPQG     5766.0
8   PGDDLDGAW     5058.0
9   LAQSDQYYW     8745.0
10  WDQPGQAPG    14946.0
11  AAYLYDYYS     8598.0
12  PWAYSDSSP     8007.0
13  AGGAGDDGY     7980.0
14  LSHHGGYGH     8022.0
15  GQQPYGPQW     8889.0
16  LAWPAAQLL     7806.0
17  SHPYPPGPL     5145.0
18  LGSDLWAAH     5346.0
19  ALDLSSASQ    10095.0
20  ALGHWHDDA    30696.0
21  LPDWWHDDA     8661.0
22  GQDQPHGYS    10455.0
23  LGWQHPLPS     6633.0
24  ASPALWDQY     5739.0
25  LQDYQLHPS     5346.0
26  PLSPDWDSY    12078.0
27  ASWSYSHHD     5283.0
28   WGGLDYGP     6018.0
29  LHAPWQDHL     7164.0
30  LQYLAPHGG     7008.0
31  SSQYDGWSL     5709.0
32  SLSHYGWLL     5472.0
33  PAYLQAAQH     5610.0
34   HGDPQQAA     7569.0
35  AHLGPWASW     6186.0
36  AGQGQAAQG     5337.0
37  LDLLHHDWH     6540.0
38  WHALPDQDD     7251.0
39  WYWGQSWSL     7176.0
40  PWLYYSADH     8178.0
41  LQLAHQASW    11529.0
42  SSQYHSLQG     5601.0
43  PWLYGLHPQ     7308.0
44  WPHYGHSGQ     6501.0

### Requirement 4 (8 points)

Using SQL, get the **exact** same results as you would get from the following python command: 

```python
transactions['DEPTDESCR'].value_counts()
```

In [146]:
transactions['DEPTDESCR'].value_counts()

Mobile Electronic Accessories    18007
Small Appliances                 15641
Mobile Electronics               13063
Home Audio                        7257
Portable Electronics              5691
Cameras & Camcorder Accessori     2732
Appliances                           4
Name: DEPTDESCR, dtype: int64

In [147]:
cust4 = pd.read_sql_query ("SELECT DEPTDESCR, COUNT(DEPTDESCR) FROM xyztrans GROUP BY DEPTDESCR", engine)

cust4

                       DEPTDESCR  COUNT(DEPTDESCR)
0                     Appliances                 4
1  Cameras & Camcorder Accessori              2732
2                     Home Audio              7257
3  Mobile Electronic Accessories             18007
4             Mobile Electronics             13063
5           Portable Electronics              5691
6               Small Appliances             15641

### Requirement 5 (8 points)

Which customers purchased over 5,000 dollars in total from Home Audio (DEPTDESCR)?<br>
Display **ACCTNO, ZIP, TOTAMT** and **DEPTDESCR**. <br>
Remember that a customer could have purchased more than one item from the <br>
Home Audio section and your output should show one line per customer with the total sales.

In [148]:
cust5 = pd.read_sql_query("SELECT xyzcust.ACCTNO, xyzcust.ZIP, xyztrans.TOTAMT, xyztrans.DEPTDESCR, sum(TOTAMT) as TOTAL \
                             FROM xyzcust INNER JOIN xyztrans ON xyzcust.ACCTNO = xyztrans.ACCTNO \
                             WHERE DEPTDESCR = 'Home Audio' group by xyztrans.ACCTNO having TOTAL > 5000 order by TOTAL desc", engine)
cust5

       ACCTNO    ZIP   TOTAMT   DEPTDESCR     TOTAL
0   AWALQSHAG  60093  4497.00  Home Audio  10616.40
1   GQGDSWGYW  60093   375.00  Home Audio  10316.25
2   LHSGAAQLH  60084    42.00  Home Audio   8840.55
3   PQGDYASGS  60091   599.97  Home Audio   8459.52
4   WAHHQDHYQ  60093   660.00  Home Audio   8368.65
5   SGAHSWLHA  60093   599.85  Home Audio   8129.28
6   SSLYQYWDA  60068   117.00  Home Audio   8021.40
7     SAPYPAP  60093   288.00  Home Audio   7645.35
8   PDSQWHQWG  60062   329.85  Home Audio   7574.55
9   ALDGDAQQA  60091  7499.85  Home Audio   7499.85
10  LGPASHSSH  60074   749.85  Home Audio   7049.13
11  GLDYDHAHG  60093   539.85  Home Audio   6994.26
12   WLPALYSY  60067  1499.85  Home Audio   6899.70
13   GPGLLLGG  60093  1065.00  Home Audio   6887.25
14  GWPLQQGGY  60067   239.85  Home Audio   6779.43
15  PLGWAQQQL  60093   239.85  Home Audio   6419.19
16  AWWHWALHL  60062   765.00  Home Audio   6224.43
17  GPHWLYGHP  60062   179.70  Home Audio   6088.80
18  PLWAYAPWA  60090  2999.85  Home Audio   6059.55
19  SDAPWQHLD  60093   210.00  Home Audio   5812.80
20   GPYASQPQ  60077   749.85  Home Audio   5758.50
21  GHDWHWGPL  60089  1230.00  Home Audio   5669.55
22  PSHLDYPYL  60069   599.85  Home Audio   5669.40
23  GYSGASQPL  60098    59.85  Home Audio   5653.11
24   DYYHYWWD  60068   779.85  Home Audio   5579.70
25  PQAAWHLQD  60093  1199.85  Home Audio   5462.10
26  WWGAPALQP  60093   389.85  Home Audio   5068.95